// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Ce logiciel doit être installé sur le volume de démmarrage.";
"ERROR_INSTALL" = "Ce volume ne remplit pas les conditions requises pour cette mise à jour.";

"Newer_Package_Installed_message" = "Une version plus récente de Chameleon est déjà installée";
"Intel_Mac_message" = "Ce logiciel ne peut être installé sur cette ordinateur.";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "Install Type";
"InstallType_description" = "Choose to perform a new installation or upgrade an existing installation.";

"New_title" = "New Installation";
"New_description" = "Backup an existing /Extra folder, if found on the target partition. A new one will be created if any options are chosen from the installer, other than the Bootloader.";

"Upgrade_title" = "Upgrade";
"Upgrade_description" = "Merge an existing /Extra folder, if found on the target, with any options chosen from the installer, other than the Bootloader.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "Chameleon requiert trois fichiers essentiels:
boot0 (Sur le MBR du disque) il est responsable du chargement de boot1.
boot1 (Sur le secteur de boot de la partition) pour trouver boot2.
boot2 (A la racine de la partition) pour charger le noyau etc.";

"Standard_title" = "Standard";
"Standard_description" = "Installe les fichiers de Chameleon à la racine de la partition sélectionnée en utilisant soit boot0 soit boot0md en fonction du système et sans détruire une installation de Windows existante.";

"EFI_title" = "EFI";
"EFI_description" = "Installe les fichiers de Chameleon dans la partition cachée EFI en utilisant soit boot0 soit boot0md en fonction du système et sans détruire une installation de Windows existante.";

"noboot_title" = "Ne pas installer de Chargeur de Démarrage";
"noboot_description" = "Utile si vous ne voulez installer que les Extras.";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Modules Chameleon";
"Module_description" = "Le système de modules intégrés à Chameleon permet à un utilisateur ou un développeur d'étendre les fonctionnalités de base de Chameleon sans remplacer le fichier de démarrage principal.";

"klibc_title" = "klibc";
"klibc_description" = "This module provides a standard c library for modules to link to if the library provided by chameleon is insufficient.
This is currently only used by the uClibc++ library.
Source: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "This module reads the edid information from the monitor attached to the main display.
The module is currently not integrated into trunk and has minimal uses as it stands.
Additionally, the module will patch the vesa modes available in pre intel hd graphics cards to provide proper resolution while booting.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "This module provides a minimalistic c++ runtime library for use in other modules.
This does not provide functionality by itself, instead it is used to allow for the c++ language to be used in other modules.
Please note that rtti and exceptions has both been disabled.
Source: http://cxx.uclibc.org/
Dependencies: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "Ce module permet de changer le plan de codage du clavier.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Utilitaires";
"Utility_description" = "Fichiers optionnels pour aider lors de l'installation";

"PrefPanel_title" = "Panneau de Préferences";
"PrefPanel_description" = "Installe le Panneau de Préférences pour Chameleon.";

"SMBIOSDefault_title" = "SMBIOS.plist";
"SMBIOSDefault_description" = "Copie un exemple de smbios.plist dans /Extra/Configuration.";

"Documentation_title" = "Documentation";
"Documentation_description" = "Installe le manuel d'installation et d'utilisation de Chameleon";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Boot Options";
"Options_description" = "Create an /Extra/org.chameleon.Boot.plist and select your desired options to control Chameleon's settings.";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Hides Chameleon's boot banner in GUI.";

"GUI_title" = "GUI=No";
"GUI_description" = "Désactive l'interface graphique.";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Use the legacy (grey on white) apple logo on the boot screen rather than the boot.png in the theme.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Display the partition selection screen without showing the timeout screen.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Enable quiet boot mode (no messages or prompt).";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "Enables display of partition and resolution details.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Pauses the boot process after Chameleon has finished it's setup then waits for a key press before it starts the mach kernel. Useful when combined with verbose boot for troubleshooting.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Boots the kernel in 32bit mode rather than the default 64bit mode.";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "fixe certains problème de branchement usb a chaud et de reconnaissance usb2 !";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "ajoute EthernetBuiltIn=y au fichier com.apple.Boot.plist, cette option ajoutera 'built-in' a votre carte ethernet.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "ajoute ForceHPET=y to com.apple.Boot.plist, Cette option active HPET sur les chipsets intel,(pour les bios qui n'ont pas cette options).";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "réveille forcé, (ajoute l'option ForceWake=y au fichier com.apple.Boot.plist)";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Disables the automatically enabled restart fix.";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "fixe quelques rares problèmes de detection usb";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Disables the automatically enabled RAM recognition.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "For Lion only. Enables loading of the pre-linked kernel. This will ignore /E/E and /S/L/E. ONLY use this is you have know it contains everything you need.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Attempts to load the sleep image saved from last hibernation.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "New - Generate C-States=Yes";
"CSTUsingSystemIO_description" = "New C-State _CST generation method using SystemIO registers instead of FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Discard the motherboard's built-in SSDT tables.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Enable specific Processor power state, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Enable specific Processor power state, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Enable specific Processor power state, C4.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Enable auto generation of processor idle sleep states (C-States).";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Enable auto generation of processor power performance states (P-States).";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Set Graphics Mode to 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Set Graphics Mode to 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Set Graphics Mode to 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Set Graphics Mode to 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Set Graphics Mode to 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Set Graphics Mode to 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Set Graphics Mode to 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Set Graphics Mode to 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Set Graphics Mode to 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Set Graphics Mode to 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Set Graphics Mode to 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Enables the option to autodetect NVIDIA based GPUs and inject the correct info.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Enables UseAtiROM options.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Enables UseNvidiaROM options.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Enables VBIOS option";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Turns on verbose logging and allows you to see messages from both Chameleon and the OS X kernel at boot time. Essential for troubleshooting.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "A troubleshooting option used for booting into OS X's BSD/Unix command line.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Not an option that's needed for everyday booting, but it can be useful if you want OS X to load all files from it's system folders, rather than relying on it's pre-built caches.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "For overcoming a hang at 'PCI configuration begin' on some systems. 0x2000 is the kIOPCIConfiguratorPFM64 flag, as seen in the IOPCIFamily source code.";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Lion only. Disables the 'low power wake' feature which can sometimes leave the screen black after wake from sleep.";


// ----------------------------------------------------------------------------
// Boot options - KEYLAYOUTS
// ----------------------------------------------------------------------------

"mac-de_title" = "Clavier Mac Allemand";
"mac-de_description" = "Utilise le plan de codage pour un clavier Mac Allemand";

"mac-es_title" = "Clavier Mac Espagnol";
"mac-es_description" = "Utilise le plan de codage pour un clavier Mac Espagnol";

"mac-fr_title" = "Clavier Mac Français";
"mac-fr_description" = "Utilise le plan de codage pour un clavier Mac Français";

"mac-it_title" = "Clavier Mac Italien";
"mac-it_description" = "Utilise le plan de codage pour un clavier Mac Italien";

"mac-se_title" = "Clavier Mac Suédois";
"mac-se_description" = "Utilise le plan de codage pour un clavier Mac Suédois";

"pc-fr_title" = "Clavier PC Keyboard";
"pc-fr_description" = "Utilise le plan de codage pour un clavier PC Français";


// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "A smaller simple version of the new default theme used when building a version of Chameleon which requires an embedded theme. ";

"Legacy_title" = "Legacy";
"Legacy_description" = "Chameleon's previous default theme";

"Default_title" = "Standard";
"Default_description" = "Ce theme est codé directement dans le fichier Boot, inclu ici pour vous comme base de customisation.";

"Bullet_title" = "Bullet";
"Bullet_description" = "Bullet thème de NoSmokingBandit";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Control Options";
"Control_description" = "Settings to control how Chameleon works.";

// General
"General_title" = "General Options";
"General_description" = "Choose from a selection of base options.";

// KernelFlags
"KernelFlags_title" = "Kernel Flags";
"KernelFlags_description" = "Choose from a selection of kernel flags.";

// PowerManagement
"PowerManagement_title" = "Power Management";
"PowerManagement_description" = "A selection of options that deal with power management and speedstep.";

// Resolution
"Resolution_title" = "Resolution";
"Resolution_description" = "Set one resolution to use, or select 'None' if you don't want to select a resolution.";

// Video
"Video_title" = "Video";
"Video_description" = "A selection of options that deal with video.";

// KeyLayout
"KeyLayout_title" = "KeyLayout";
"KeyLayout_description" = "Fixe le plan de codage du clavier à utiliser";

// Themes
"Themes_title" = "Themes";
"Themes_description" = "Une collection de themes samplé
More themes can be found at http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "None";
"ChooseNone-Resolution_description" = "Don't choose a resolution.";

"ChooseNone-keylayout_title" = "None";
"ChooseNone-keylayout_description" = "Don't choose a keylayout.";
